In [1]:
import pandas as pd

data = {
    'id' : [1,2,3],
    'name' : ['Choi', 'Lee', 'Kim'],
    'age' : [10,20,30],
    'assets' : [150.4, 123.4, 88.88],
    'job' : ['student','CEO','Dad']
}

In [2]:
df = pd.DataFrame(data)
df

   id  name  age  assets      job
0   1  Choi   10  150.40  student
1   2   Lee   20  123.40      CEO
2   3   Kim   30   88.88      Dad

In [4]:
df.index = df['id']

In [5]:
df

    id  name  age  assets      job
id
1    1  Choi   10  150.40  student
2    2   Lee   20  123.40      CEO
3    3   Kim   30   88.88      Dad

In [6]:
df['id']

id
1    1
2    2
3    3
Name: id, dtype: int64

In [8]:
df.ix[1]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

id              1
name         Choi
age            10
assets      150.4
job       student
Name: 1, dtype: object

In [9]:
df = pd.DataFrame(data, columns = ['id', 'name','job','age','asset','hobby'], index = ['one','two','three'])

In [10]:
df

       id  name      job  age asset hobby
one     1  Choi  student   10   NaN   NaN
two     2   Lee      CEO   20   NaN   NaN
three   3   Kim      Dad   30   NaN   NaN

In [11]:
df['hobby'] = 'reading books'

In [12]:
df

       id  name      job  age asset          hobby
one     1  Choi  student   10   NaN  reading books
two     2   Lee      CEO   20   NaN  reading books
three   3   Kim      Dad   30   NaN  reading books

In [33]:
res = {'one' : "Bundang", 'two' : "Seoul", 'three' : "Incheon"}

In [34]:
res_se = pd.Series(res)

In [35]:
res_se

one      Bundang
two        Seoul
three    Incheon
dtype: object

In [36]:
df['res'] = res_se

In [37]:
df

       id  name      job  age asset          hobby      res
one     1  Choi  student   10   NaN  reading books  Bundang
two     2   Lee      CEO   20   NaN  reading books    Seoul
three   3   Kim      Dad   30   NaN  reading books  Incheon